In [1]:
import pandas as pd

In [18]:
pwd

'E:\\python_ml\\python_basics'

In [22]:
cd python_basics

E:\python_ml\python_basics

In [23]:
df = pd.read_csv('employees.csv')

# read_csv is used to read csv files

In [24]:
df

      Name    Address  Gender  Salary
0   Rajesh    Ghorahi    Male   12000
1  Jeffrey  Bharatpur  Female   14000
2   Shyame   Ratanpur    Male   10000

In [42]:
df.values.tolist()
#df.as_matrix

[['Rajesh', 'Ghorahi', 'Male', 12000],
 ['Jeffrey', 'Bharatpur', 'Female', 14000],
 ['Shyame', 'Ratanpur', 'Male', 10000]]

# values.tolist() is used to convert data from csv file to matrix format

In [25]:
df[['Address','Name']]

     Address     Name
0    Ghorahi   Rajesh
1  Bharatpur  Jeffrey
2   Ratanpur   Shyame

# here we have used two brackets to pass list

In [29]:
df[df['Salary']>13000]

      Name    Address  Gender  Salary
1  Jeffrey  Bharatpur  Female   14000

In [30]:
df.describe()

        Salary
count      3.0
mean   12000.0
std     2000.0
min    10000.0
25%    11000.0
50%    12000.0
75%    13000.0
max    14000.0

# we can use numpy feature to get data description such as mean, quartile, and so on